Revit 2026 API

# ParameterSetValueString Method

---

Set the parameter value according to the input string.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SetValueString(
	string valueString
)
```
```vb
Public Function SetValueString (
	valueString As String
) As Boolean
```
```cpp
public:
bool SetValueString(
	String^ valueString
)
```
```fsharp
member SetValueString :
        valueString : string -> bool
```

#### Parameters

valueString String
    The string that represents the parameter value.

#### Return Value

BooleanIndicates whether the parameter value is successfully set.

The method only applies to parameters of value types.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace